export const ANSWERS = [
    "Ніколи", "Рідко", "Іноді", "Часто", "Дуже часто"
];

export const QUESTIONS_PART_A = [
    "Як часто у вас виникають проблеми з завершенням остаточних деталей проекту після завершення складних частин?",
    "Як часто вам важко навести порядок, коли вам потрібно виконати завдання, яке вимагає організації?",
    "Як часто у вас виникають проблеми із запам'ятовуванням зустрічей або зобов'язань?",
    "Як часто ви уникаєте чи відкладаєте початок роботи, коли у вас є завдання, яке потребує багато роздумів?",
    "Як часто ви вередуєте або звиваєтеся руками або ногами, коли вам доводиться довго сидіти?",
    "Як часто ви відчуваєте себе надмірно активним і змушеним щось робити, наче вас рухає мотор?"
]; 

export const QUESTIONS_PART_B = [
    "Як часто ви робите необережні помилки, коли вам доводиться працювати над нудним або складним проектом?",
    "Як часто вам важко втримати увагу, коли ви виконуєте нудну або повторювану роботу?",
    "Як часто вам важко зосередитися на тому, що вам говорять люди, навіть коли вони говорять безпосередньо з вами?",
    "Як часто ви губите або відчуваєте труднощі з пошуком речей вдома чи на роботі?",
    "Як часто вас відволікає діяльність або шум навколо вас? ",
    "Як часто ви залишаєте своє місце під час зустрічей або в інших ситуаціях, коли очікується, що ви залишитесь сидіти?",
    "Як часто ви відчуваєте неспокій або вередування?",
    "Як часто вам важко відпочити та розслабитися, коли у вас є час для себе?",
    "Як часто ви бачите, що багато говорите, коли перебуваєте в соціальних ситуаціях?",
    "Як часто під час розмови ви закінчуєте речення людей, з якими розмовляєте, перш ніж вони встигають їх закінчити?",
    "Як часто вам важко чекати своєї черги в ситуаціях, коли потрібна черга?",
    "Як часто ви перебиваєте інших, коли вони зайняті?"
]; 