
export const A_QUESTIONS = [
    "Чи часто ви не приділяєте належної уваги деталям, чи допускаєте необережні помилки в роботі або під час інших занять? І як це було в дитинстві (у шкільних завданнях чи в інших видах діяльності)?",
    "Чи є у вас труднощі з концентрацією уваги під час виконання завдань? І як це було в дитинстві (в ігровій ситуації)?",
    "Чи часто вам здається, що ви не слухаєте, коли до вас звертаються безпосередньо? І як це було в дитинстві?",
    "Чи часто ви не виконуєте інструкції і не встигаєте закінчити домашні справи або обов'язки на роботі? І як це було в дитинстві (у школі?)?",
    "Чи часто вам важко організувати завдання та діяльність? І як це було в дитинстві?",
    "Чи часто ви уникаєте (або вам не подобається, або ви неохоче беретеся за завдання, які вимагають тривалих розумових зусиль? І як це було в дитинстві?",
    "Чи часто ви втрачаєте речі, які необхідні для виконання завдань чи діяльності? І як це було в дитинстві?",
    "Чи часто ви легко відволікаєтеся на сторонні подразники? І як це було у вашому дитинстві?",
    "Чи часто ви забудькуваті у повсякденних справах? І як це було в дитинстві?"
]

export const A_ANSWERS = {
    A1: {
        adult: [
            "Робить необережні помилки",
            "Працює повільно, щоб уникнути помилок",
            "Працює неточно",
            "Не уважно читає інструкції",
            "Ігнорує або пропускає деталі",
            "Занадто багато часу витрачає на виконання детальних завдань",
            "Часто зациклюється на деталях",
            "Працює занадто швидко і тому робить помилки"
        ],
        child: [
            "Необережні помилки в шкільних роботах",
            "Помилки, зроблені через неуважне читання запитань",
            "Не звертає уваги на деталі або пропускає їх",
            "Неточне виконання роботи",
            "Залишає питання без відповіді, не прочитавши їх належним чином",
            "Коментарі інших про недбалу роботу",
            "Не перевіряє відповіді в домашньому завданні",
            "Забагато часу витрачає на виконання детальних завдань"
        ]
    },
    A2: {
        adult: [
            "Не здатні довго утримувати увагу на завданнях*",
            "Швидко відволікається на власні думки або асоціації",
            "Легко відволікається на сторонні думки",
            "Відчуває труднощі залишатися зосередженим під час лекцій та/або розмов",
            "Не може додивитися фільм до кінця або прочитати книгу*",
            "Швидко починає нудьгувати*",
            "Ставить запитання про теми, які вже обговорювалися"
        ],
        child: [
            "Труднощі з концентрацією уваги на шкільних завданнях",
            "Труднощі з утриманням уваги під час гри*",
            "Труднощі з концентрацією уваги під час лекцій та/або розмов",
            "Легко відволікається",
            "Труднощі з концентрацією уваги*",
            "Потреба в чіткій структурі поведінки, щоб не відволікатися",
            "Швидко набридає діяльність*"
        ]
    },
    A3: {
        adult: [
            "Мрійливість або заклопотаність",
            "Складність зосередитися на розмові",
            "Незнання після розмови, про що вона була",
            "Часта зміна теми розмови",
            "Коментарі інших, що думки десь в іншому місці",
            "Швидко починає нудьгувати*",
            " Здається, що думки десь в іншому місці, навіть якщо нічого не відволікає"
        ],
        child: [
            "Незнання того, що сказали батьки/вчителі",
            "Мрійливість або заклопотаність",
            "Зосередження уваги тільки під час зорового контакту або коли підвищують голос",
            "Здається, що думки десь в іншому місці, навіть якщо нічого не відволікає",
            "Часто доводиться звертатися повторно",
            "Потреба в чіткій структурі поведінки, щоб не відволікатися",
            "Запитання доводиться повторювати"
        ]
    },
    A4:{
        adult: [
            "Виконує справи, які переплутані між собою, не завершуючи їх",
            "Починає виконувати завдання, але швидко втрачає фокус і легко відволікається",
            "Потребує часових обмежень для виконання завдань",
            "Труднощі з виконанням організаційних завдань",
            "Труднощі з виконанням інструкцій з посібника"
        ],
        child: [
            "Проблеми з виконанням вказівок",
            "Проблеми з виконанням завдань, які мають декілька частин"
        ]
    },
    A5:{
        adult: [
            "Труднощі з плануванням повсякденного життя",
            "Труднощі з виконанням послідовних завдань",
            "Неорганізованість вдома та/або на робочому місці",
            "Труднощі з упорядкуванням матеріалів та речей",
            "Робота безладна і неорганізована",
            "Планування занадто великої кількості завдань або неефективне планування",
            "Регулярне планування справ на один і той самий час (подвійне бронювання",
            "Запізнення на роботу",
            "Недотримування дедлайні",
            "Невміння послідовно користуватися розкладом або щоденником",
            "Негнучкість через необхідність дотримуватися графіків",
            "Погане відчуття та управління часом",
            "Створення графіків, але не використання їх",
            "Потреба в інших людях для структурування спра"
        ],
        child: [
            "Складно бути готовим вчасно",
            "Складно бути готовим вчасн",
            "Труднощі з упорядкуванням матеріалів та рече",
            "Труднощі з іграми наодинці",
            "Труднощі з плануванням завдань чи домашнього завдання",
            "Недотримання дедлайнів",
            "Незграбне виконання речей",
            "Запізнення на заняття",
            "Погане відчуття часу",
            "Труднощі з тим, щоб себе розважити"
        ]
    },
    A6: {
        adult: [
            "Виконує в першу чергу найпростіші або найприємніші речі",
            "Часте відкладання нудних або складних завдань",
            "Відкладає завдання і пропускає дедлайни",
            "Уникання монотонної роботи, наприклад, управління",
            "Уникання підготовки звітів, заповнення форм або перегляду довгих документів",
            "Не любить читати через розумові зусилля",
            "Уникає завдань, які вимагають великої концентрації уваги",
        ],
        child: [
            "Уникає виконання домашніх завдань або має відразу до цього",
            "Читає мало книг або не відчуває бажання читати через розумові зусилля",
            "Уникає завдань, які вимагають великої концентрації уваги",
            "Відраза до шкільних предметів, які вимагають великої концентрації уваги",
            "Часто відкладає нудні або складні завдання"
        ]
    },
    A7: {
        adult: [
            "Втрачає інструменти, документи, окуляри, мобільні телефони, гаманець, ключі або календар",
            "Часто забуває речі",
            "Втрачає документи для роботи",
            "Втрачає багато часу на пошук речей",
            "Впадає в паніку, якщо інші люди пересувають речі",
            "Зберігає речі в неналежному місці",
            "Втрачає нотатки, списки або номери телефонів"
        ],
        child: [
            "Втрачає шкільне приладдя, олівці, книги чи інші речі",
            "Читає мало книжок або не відчуває бажання читати через розумові зусилля",
            "Губить іграшки, одяг або домашні завдання",
            "Витрачає багато часу на пошук речей",
            "Впадає в паніку, якщо інші люди пересувають речі",
            "Коментарі батьків та/або вчителів щодо загублених речей"
        ]
    },
    A8: {
        adult: [
            "Труднощі з відключенням від зовнішніх подразників",
            "Після того, як відволіклися, важко знову взятися за справу",
            "Легко відволікається на шуми або події",
            "Легко відволікається на розмови інших людей",
            "Труднощі з фільтруванням та/або відбором інформації"
        ],
        child: [
            "У класі часто дивиться на вулицю",
            "Легко відволікається на шуми або події",
            "Після того, як відволіклися, важко знову взятися за справу"
        ]
    },
    A9: {
        adult: [
            "Забуває про зустрічі або інші зобов'язання",
            "Забуває ключі, розклад тощо",
            "Потребує частих нагадувань про зустрічі",
            "Забуває оплатити рахунки або передзвонити",
            "Повертається додому за забутими речами",
            "Жорстке використання списків, щоб нічого не забути",
            "Забуває зберігати чи переглядати щоденний порядок денний",
            "Забуває виконати домашні справи чи доручення"
        ],
        child: [
            "Забуває про зустрічі чи доручення",
            "Забуває виконувати домашні справи або доручення",
            "Доводиться часто про щось нагадувати",
            "На півдорозі виконання завдання забуває про те, що має бути зроблено",
            "Забуває взяти речі до школи",
            "Залишає речі в школі або вдома у друзів"
        ]
    }
}

export const H_QUESTIONS = [
    "Чи часто ви метушитеся, постукуєте руками чи ногами, чи часто соваєтесь на своєму місці? І як це було в дитинстві?",
    "Чи часто ви встаєте зі свого місця в ситуаціях, коли потрібно залишатися на місці? І як це було в дитинстві?",
    "Ви часто відчуваєте себе неспокійно? А як це було в дитинстві?",
    "Чи часто вам важко спокійно займатися дозвіллям? І як це було в дитинстві (в ігровій діяльності)?",
    "Ви постійно «в русі» чи відчуваєте ніби «йдете на автоматі»? Як це було в дитинстві?",
    "Ви часто маєте прояв надмірної балакучості? І як це було в дитинстві?",
    "Чи часто ви вимовляєте відповідь до того, як питання було завершено? І як це було в дитинстві?",
    "Чи часто вам буває важко дочекатися своєї черги? І як це було в дитинстві?",
    "Чи часто ви перебиваєте або заважаєте іншим? І як це було в дитинстві?"
];

export const H_ANSWERS  = {
    H1: {
        adult: [
            "Труднощі з сидінням на місці",
            "Совання ногами",
            "Постукування ручкою або гра з чимось",
            "Смикає волосся або гризе нігті",
            "Здатність контролювати неспокій, але відчуває стрес через це"
        ],
        child: [
            "Батьки часто кажуть 'сиди спокійно' або щось подібне",
            "Соває ногами",
            "Постукування ручкою або гра з чимось",
            "Смикає волосся або гризе нігті",
            "Здатність контролювати неспокій, але відчуває стрес через це"
        ]
    },
    H2: {
        adult: [
            "Часто залишає своє місце в офісі або на робочому місці",
            "Надає перевагу роботі в русі, а не сидінню",
            "Ніколи довго не сидить на місці, завжди рухається",
            "Переживає стрес через те, що важко всидіти на місці",
            "Вигадує відмовки, щоб мати можливість ходити"
        ],
        child: [
            "Часто встає під час їжі або покидає своє місце в класі",
            "Дуже важко всидіти на місці в школі або під час їжі",
            "Отримує вказівки сидіти на місці",
            "Придумує відмовки, щоб мати змогу походити"
        ]

    },
    H3: {
        adult: [
            "Відчуття неспокою або хвилювання всередині",
            "Постійне відчуття, що потрібно щось робити",
            "Важко розслабитися"
        ],
        child: [
            "Завжди бігає там, де це недоречно",
            "Лазить по меблях або стрибає на дивані",
            "Лазить по деревах",
            "Відчуття неспокою всередині"
        ]
    },
    H4: {
        adult: [
            "Розмови під час занять, коли це недоречно",
            "Занадто швидко поводиться на людях самовпевнено",
            "Говорить голосно в будь-яких ситуаціях",
            "Труднощі з тихим мовленням"
        ],
        child: [
            "Говорить голосно під час гри або в класі",
            "Не може спокійно дивитися телевізор або фільми",
            "Інші просять поводитися тихіше або заспокоїтися",
            "Занадто швидко поводиться на людях самовпевнено"
        ]
    },
    H5: {
        adult: [
            "Постійна зайнятість",
            "Незручно перебувати на місці протягом тривалого часу, наприклад, у ресторанах або на зустрічах",
            "Має занадто багато енергії, завжди в русі",
            "Інші вважають неспокійним/ою або, за яким/ою важко встигати",
            "Переступає власні межі",
            "Важко відпускати справи, надмірна цілеспрямованість"
        ],
        child: [
            "Постійна зайнятість",
            "Інші вважають неспокійним/ою або, за яким/ою важко встигати",
            "Некомфортно залишатися нерухомо протягом тривалого часу",
            "Надмірна активність в школі та вдома",
            "Має багато енергії",
            "Завжди в русі, надмірна цілеспрямованість"
        ]
    },
    H6: {
        adult: [
            "Надзвичайна зайнятість розмовами, що інших людей це втомлює",
            "Вважається безперервним балакуном",
            "Схильність говорити занадто багато",
            "Не дає іншим можливість вставити слово під час розмови",
            "Потребує багато слів, щоб висловити думку"
        ],
        child: [
            "Вважається базікою",
            "Вчителі та батьки часто просять поводитися тихіше",
            "Зауваження у шкільних відгуках про те, що занадто багато говорить",
            "Карають за надмірну балакучість",
            "Заважає іншим виконувати шкільні завдання, бо занадто багато говорить",
            "Не дає іншим можливості висловитися під час розмови"
        ]
    },
    H7: {
        adult: [
            "Бути базікою, говорити те, що спадає на думку",
            "Говорити речі, не подумавши спочатку",
            "Давати людям відповіді до того, як вони закінчили говорити",
            "Закінчувати речення за інших людей",
            "Проявляти нетактовність"
        ],
        child: [
            "Бути базікою, говорити те, що спадає на думку не думаючи",
            "Бажання першим/ою відповідати на запитання в школі",
            "Викрикує відповідь, навіть якщо вона неправильна",
            "Перебиває інших, не даючи їм закінчивши речення",
            "Труднощі з очікуванням своєї черги під час розмови",
            "Не дає іншим можливості висловитися під час розмови",
            "Проявляє нетактовність"
        ]
    },
    H8: {
        adult: [
            "Труднощі з очікуванням у черзі, перестрибування черги",
            "Важко терпляче чекати в транспорті/заторах",
            "Нетерплячість",
            "Швидко починати стосунки/роботу та закінчувати/закінчувати їх через нетерпіння"
        ],
        child: [
            "Труднощі з очікуванням своєї черги в груповій діяльності",
            "Труднощі з очікуванням своєї черги в класі",
            "Завжди першим починає говорити або діяти",
            "Швидко втрачає терпіння",
            "Переходить дорогу, не дивлячись"
        ]
    },
    H9: {
        adult: [
            "Швидко втручається в роботу інших",
            "Втручається в чужі справи",
            "Втручається в діяльність інших людей без дозволу або перебирає на себе їхні обов'язки",
            "Коментарі інших про втручання",
            "Труднощі з повагою до простору інших людей",
            "Має власну думку про все і одразу її висловлює"
        ],
        child: [
            "Перериває ігри або діяльність інших людей",
            "Починає користуватися чужими речами без запиту чи дозвол",
            "Перебиває розмову інших людей",
            "Реагує на все",
            "Не вміє чекати"
        ]
    }
};

export const C_QUESTIONS = [
    "Робота/освіта",
    "Відносини та/або сім’я",
    "Вільний час/хобі",
    "Спілкування з людьми",
    "Самооцінка / самовпевненість",
    "Освіта",
    "Спілкування з людьми",
    "Самооцінка / самовпевненість",
    "Сім’я",
    "Вільний час/хобі"
];

export const C_ANSWERS = {
    C1: [
        "Не завершили освіту/підготовку, необхідну для роботи",
        "Робота нижче рівня освіти",
        "Швидка втома від робочого місця",
        "Наявність великої кількості зміни робочих місць",
        "Труднощі з управлінською роботою/плануванням",
        "Не вдається досягти просування по службі",
        "Низька продуктивність на роботі",
        "Покидання роботи після суперечок або виключення",
        "Допомога через хворобу/інвалідність внаслідок симптомів",
        "Обмежена втрата працездатності через компенсацію високого IQ",
        "Допомога у зв'язку з хворобою/інвалідністю внаслідок симптомів",
        "Обмежена втрата працездатності через компенсацію високого IQ",
        "Обмежена втрата працездатності через компенсацію зовнішньої статури"
    ],
    C2: [
        "Швидка втома від стосунків",
        "Імпульсивність на початку/кінці стосунків",
        "Нерівні стосунки з партнером через симптоми",
        "Проблеми у стосунках, багато суперечок, брак близькості",
        "Розлучення через симптоми",
        "Проблеми з сексуальністю внаслідок симптомів",
        "Проблеми з вихованням внаслідок симптомів",
        "Труднощі з веденням домашнього господарства та/або керуванням",
        "Фінансові проблеми або залежність від азартних ігор",
        "Не наважується розпочати стосунки"
    ],
    C3: [
        "Неможливість належним чином розслабитися у вільний час",
        "Необхідність багато займатися спортом, щоб розслабитися",
        "Травми внаслідок надмірних занять спортом",
        "Неможливість дочитати книгу або подивитися фільм до кінця",
        "Постійна зайнятість і, як наслідок, перевтома",
        "Швидко втомлюєтеся від хобі",
        "Нещасні випадки/втрата водійського посвідчення внаслідок необережного поводження за кермом",
        "Прагнення до сенсацій та/або надмірний ризик",
        "Конфлікт з поліцією/судом",
        "Переїдання"
    ],
    C4: [
        "Швидка втома від стосунків",
        "Труднощі з підтриманням соціальних контактів",
        "Конфлікти як наслідок проблем у спілкуванні",
        "Труднощі з ініціюванням соціальних контактів",
        "Низький рівень самоствердження внаслідок негативного досвіду",
        "Неуважність (наприклад, забути надіслати листівку / поспівчувати / зателефонувати тощо)",
        "Проблеми з вихованням внаслідок симптомів",
        "Труднощі з веденням домашнього господарства та/або керуванням",
        "Фінансові проблеми або залежність від азартних ігор",
        "Не наважується розпочати стосунки"
    ],
    C5: [
        "Невпевненість через негативні коментарі оточуючих",
        "Негативна самооцінка через досвід невдач",
        "Страх невдачі в плані початку нових справ",
        "Надмірно гостра реакція на критик",
        "Перфекціонізм",
        "Переживання через симптоми СДУГ"
    ],
    C6: [
        "Нижчий рівень освіти, ніж очікувалося на основі IQ",
        "Залишення на другий рік (повторні заняття) через проблеми з концентрацією уваги",
        "Освіта не завершена / відрахування зі школи",
        "Здобуття освіти зайняло набагато більше часу, ніж зазвичай",
        "Здобута освіта, що відповідає IQ, але з великими зусиллями",
        "Труднощі з виконанням домашніх завдань",
        "Отримана спеціальна освіта через симптоми",
        "Зауваження від вчителів щодо поведінки чи концентрації уваги",
        "Обмежені порушення через компенсацію високого IQ",
        "Обмежені порушення через компенсацію зовнішньої будови"
    ],
    C7: [
        "Труднощі з підтриманням соціальних контактів",
        "Конфлікти як наслідок проблем зі спілкуванням",
        "Труднощі зі встановленням соціальних контактів",
        "Низька самооцінка внаслідок негативного досвіду",
        "Мало друзів",
        "Люди дражнять",
        "Ігнорування або недопущення до спільної діяльності з групою",
       "Задирака"
    ],
    C8: [
        "Невпевненість через негативні коментарі оточуючих",
        "Негативна самооцінка через досвід невдач",
        "Страх невдачі в плані початку нових справ",
        "Надмірно гостра реакція на критику",
        "Перфекціонізм"
    ],
    C9: [
        "Часті суперечки з братами чи сестрами",
        "Часті покарання чи ховання від членів сім’ї",
        "Замалий контакт з сім’єю через суперечки",
        "Батьки завдають чітку дисципліну довше, ніж це мало би бути"
    ],
    C10: [
       "Неможливість належним чином розслабитися у вільний час",
        "Необхідність багато займатися спортом, щоб розслабитися",
        "Травми внаслідок надмірних занять спортом",
        "Неможливість дочитати книгу або подивитися фільм до кінця",
        "Постійна зайнятість і, як наслідок, перевтома",
        "Швидка втома від хобі",
        "Прагнення до гострих відчуттів та/або надмірний ризик",
        "Конфлікти з поліцією/судом",
        "Збільшення кількості нещасних випадків"
    ]
}