export const ANSWERS = ["Зовсім ні", "Трохи", "Помітно", "Доволі часто", "Дуже часто"];

export const QUESTIONS = [
  "Проблеми з концентрацією уваги, розсіяність",
  "Тривожність, занепокоєність",
  "Нервовість, непосидючість",
  "Неуважність, мрійливість",
  "Запальність або нестриманість, низька межа терпіння",
  "Спалахи гніву, істерики",
  "Проблеми з наполегливістю, не доводити справу до кінця, не виходило завершити розпочате",
  "Упертість, норовливість",
  "Засмученість або журливість, депресивність",
  "Неслухняність до батьків, бунтарські почуття, зухвалість",
  "Низька думка про себе",
  "Дратівливість",
  "Примхливість, злети і падіння настрою",
  "Злість",
  "Дія не подумавши, імпульсивність",
  "Схильність до інфантильності",
  "Почуття провини чи жалю",
  "Втрата контролю над собою",
  "Схильність до ірраціональних вчинків або дій",
  "Непопулярність серед інших дітей, недовга тривалість дружби, відсутність ладу з іншими дітьми",
  "проблеми з розумінням чужої точки зору",
  "проблеми з владою, проблеми зі школою, візити до директора",
  "У дитинстві в школі я був (або була) загалом поганим учнем, навчальний процес йшов повільно",
  "проблеми з математикою або числами",
  "Недосягнення власного потенціалу"
];